#1)--ახსენი რისთვის გამოიყენება ინდექსინი, 

#ინდექსით შეგვიძლია შევცვალოთ ელემენტი ასევე შეგვიძლია კონკრეტულ სისს კონკრეტული ნაწილი მივიღოთ

#2)დაწერე ინდექსინგის  მაგალიათი ანუ შექმენი დიდი სია და გამოიყენე ინდექსინგი და დაპრინე მე 0-ინდექსი 1-ინდექსი 2-ინდექსი 3-ინდექსი 4-ინდექსი და ასევე 5 ჯერ შეუცვალე მნიშვნელობა სიაში არებულ ელემენტებს ინდექსინგის მეშვეობით

list = ['vashli','alubali','banani','atami','marwyvi']

print(list[0])
print(list[1])
print(list[2])
print(list[3])
print(list[4])


list[0] = "sazamtro"
list[1] = "nesvi"
list[2] = "yurzeni"
list[3] = "msxali"
list[4] = "vashlatama"
print(list)