#1) მომხმარებელს შემოატანინეთ სიტყვა, თუ ამ სიტყვის სიგრძე არის 5-ზე მეტი, მაშინ გამოვიტანოთ ყველა ასო, პატარა შრიფტით,
#  თუ არადა დიდით.


word = input('შეიყვანე სიტყვა: ')

if len(word) > 5:
    print(word.lower())
else:
    print(word.upper())

#2)შექმენით ფუნქცია რომელიც არგუმენტად იღებს სიტყვას/წინადადებას და ასოს, ის აბრუნებს პირველი სად შეხვდა ასო ამ სიტყვაში

def letter(text, letter):
    return text.find(letter)

#3)შექმენით ერთი ვოიდ ფუნქცია და ერთი ფუნქცია რომელიც აბრუნებს სტრინგს.

def greet(name):
    print('hello' + name)
print(greet('შოთიკო'))