# #დავალება 2:
# შეიყვანე 5 სიტყვა, მაგრამ შეინახე (დაახსოვრე) მხოლოდ ისინი, რომლებიც სწორია.
#  რა არის „სწორი“ სიტყვა?
# ამაში უნდა გითხრან წინასწარ რა კრიტერიუმით აირჩიე სწორი, მაგრამ დავუშვათ, სიტყვა სწორია მაშინ, როცა მასში ორივე — პირველი და ბოლო ასოები — თანხმოვნებია.
# შენ უნდა უთხრა 5 სიტყვა. რობოტი კი შეინახავს მხოლოდ იმ სიტყვებს, რომლებიც სწორია.

lst = []
xmovani = 'aeiou'

for i in range(5):
    word = input('შეიყვანე სიტყვა: ')
    if word[0] not in xmovani and word[-1] not in xmovani:
        lst.append(word)
print(lst)